YUNSUNGWOONG/rtu_S32K312_R44-24.07.1_R240724_ARMGCC/Static_Code/Modules/Mem_R44/arch/delivery/inc/Mem_76_Pfls_Regs.h
/*******************************************************************************
**                                                                            **
**  (C) 2022 HYUNDAI AUTOEVER Corp.                                           **
**  Confidential Proprietary Information. Distribution Limited.               **
**  This source code is permitted to be used only in projects contracted      **
**  with Hyundai Autoever, and any other use is prohibited.                   **
**  If you use it for other purposes or change the source code,               **
**  you may take legal responsibility.                                        **
**  In this case, There is no warranty and technical support.                 **
**                                                                            **
**  SRC-MODULE: Mem_76_Pfls_Regs.h                                            **
**                                                                            **
**  TARGET    : All                                                           **
**                                                                            **
**  PRODUCT   : AUTOSAR Memory Driver                                         **
**                                                                            **
**  PURPOSE   : Provide all marcos for internal module                        **
**                                                                            **
**  PLATFORM DEPENDANT [yes/no]: no                                           **
**                                                                            **
**  TO BE CHANGED BY USER [yes/no]: no                                        **
**                                                                            **
*******************************************************************************/

/*******************************************************************************
**                      Revision History                                      **
********************************************************************************
** Revision  Date          By                        Description              **
********************************************************************************
** 1.0.0     13-Sep-2022   LinhTT36                  Redmine #35543           **
*******************************************************************************/
#ifndef MEM_76_PFLS_REGS_H
#define MEM_76_PFLS_REGS_H
/*******************************************************************************
**                      Include Section                                       **
********************************************************************************/

/*******************************************************************************
**                     Global Type  definition                                **
********************************************************************************/
/* total number of block within Pflash memory - MCU dependent*/
#if((MEM_76_PFLS_SUPPORT_MCU ==MEM_76_PFLS_MCU_S32K312) | (MEM_76_PFLS_SUPPORT_MCU ==MEM_76_PFLS_MCU_S32K311))
#define MEM_76_PFLS_BLOCK_COUNT                                 2u
#elif(MEM_76_PFLS_SUPPORT_MCU ==MEM_76_PFLS_MCU_S32K314)
#define MEM_76_PFLS_BLOCK_COUNT                                 4u
#endif

#if(MEM_76_PFLS_SUPPORT_MCU ==MEM_76_PFLS_MCU_S32K311)
#define MEM_76_PFLS_B_BANK_OFFSET                          0x00100000UL
#elif(MEM_76_PFLS_SUPPORT_MCU ==MEM_76_PFLS_MCU_S32K312)
#define MEM_76_PFLS_B_BANK_OFFSET                          0x00100000UL
#elif(MEM_76_PFLS_SUPPORT_MCU ==MEM_76_PFLS_MCU_S32K314)
#define MEM_76_PFLS_B_BANK_OFFSET                          0x00200000UL
#endif

/* cycle of write command */
#define MEM_76_PFLS_GET_CYCLE_OF_WRITE_COMMAND(writeSize)      (writeSize / 32U)
/* a program/erase sector consist of 8KB */
#define MEM_76_PFLS_SECTOR_SIZE                                 (8192u)
/* super sector size - 64KB = 65536 bytes  */
#define MEM_76_PFLS_SUPER_SECTOR_SIZE                          (65536u)
/** FLASH - Size of Registers Arrays */
#define MEM_76_PFLS_FLASH_UM_COUNT                                           9u
#define MEM_76_PFLS_FLASH_DATA_COUNT                                        32u

/** PFLASH (Flash Memory Controller) - Size of Registers Arrays */
#define MEM_76_PFLS_PFLASH_PFCRI_COUNT                                        3u
#define MEM_76_PFLS_PFLASH_PFCBLKI_SPELOCK_COUNT                              3u
#define MEM_76_PFLS_PFCBLKU_SPELOCK_COUNT                                     1u
#define MEM_76_PFLS_PFLASH_PFCBLKI_SSPELOCK_COUNT                             2u
#define MEM_76_PFLS_PFLASH_PFCBLKI_SETSLOCK_COUNT                             3u
#define MEM_76_PFLS_PFCBLKU_SETSLOCK_COUNT                                    1u
#define MEM_76_PFLS_PFLASH_PFCBLKI_SSETSLOCK_COUNT                            2u
#define MEM_76_PFLS_PFLASH_PFCBLKI_LOCKMASTER_S_COUNT                         3u
#define MEM_76_PFLS_PFLASH_PFCBLKI_LOCKMASTER_S_PFCBLKI_LOCKMASTER_SJ_COUNT   8u
#define MEM_76_PFLS_PFCBLKU_LOCKMASTER_S_COUNT                                1u
#define MEM_76_PFLS_PFLASH_PFCBLKI_LOCKMASTER_SS_PFCBLKI_LOCKMASTER_SSJ_COUNT 3u
#define MEM_76_PFLS_PFLASH_PFCBLKI_LOCKMASTER_SS_COUNT                        2u

/** Embedded Flash Memory - Register Layout Typedef */
typedef struct {
  volatile uint32       MCR;                               /**< Module Configuration, offset: 0x0 */
  volatile uint32       MCRS;                              /**< Module Configuration Status, offset: 0x4 */
  volatile const uint32 MCRE;                              /**< Extended Module Configuration, offset: 0x8 */
  volatile uint32       CTL;                               /**< Module Control, offset: 0xC */
  volatile uint32       ADR;                               /**< Address, offset: 0x10 */
  volatile const uint32 PEADR;                             /**< Program and Erase Address, offset: 0x14 */
  uint8                 RESERVED_0[56];
  volatile const uint32 SPELOCK;                           /**< Sector Program and Erase Hardware Lock, offset: 0x50 */
  volatile const uint32 SSPELOCK;                          /**< Super Sector Program and Erase Hardware Lock, offset: 0x54 */
  uint8                 RESERVED_1[24];
  volatile const uint32 XSPELOCK;                          /**< Express Sector Program and Erase Hardware Lock, offset: 0x70 */
  volatile const uint32 XSSPELOCK;                         /**< Express Super Sector Program and Erase Hardware Lock, offset: 0x74 */
  uint8                 RESERVED_2[24];
  volatile uint32       TMD;                               /**< Test Mode Disable Password Check, offset: 0x90 */
  volatile uint32       UT0;                               /**< UTest 0, offset: 0x94 */
  volatile uint32       UM[MEM_76_PFLS_FLASH_UM_COUNT];    /**< UMISRn, array offset: 0x98, array step: 0x4 */
  volatile uint32       UM9;                               /**< UMISR9, offset: 0xBC */
  uint8                 RESERVED_3[16];
  volatile uint32       UD0;                               /**< UTest Data 0, offset: 0xD0 */
  volatile uint32       UD1;                               /**< UTest Data 1, offset: 0xD4 */
  volatile uint32       UD2;                               /**< UTest Data 2, offset: 0xD8 */
  volatile uint32       UD3;                               /**< UTest Data 3, offset: 0xDC */
  volatile uint32       UD4;                               /**< UTest Data 4, offset: 0xE0 */
  volatile uint32       UD5;                               /**< UTest Data 5, offset: 0xE4 */
  volatile uint32       UA0;                               /**< UTest Address 0, offset: 0xE8 */
  volatile uint32       UA1;                               /**< UTest Address 1, offset: 0xEC */
  volatile uint32       XMCR;                              /**< Express Module Configuration, offset: 0xF0 */
  volatile const uint32 XPEADR;                            /**< Express Program Address, offset: 0xF4 */
  uint8                 RESERVED_4[8];
  volatile uint32       DATA[MEM_76_PFLS_FLASH_DATA_COUNT];/**< Program Data, array offset: 0x100, array step: 0x4 */
} FLASH_Type, *FLASH_MemMapPtr;

/** PFLASH - Flash Memory Controller- Register Layout Typedef */
typedef struct {
  volatile uint32       PFCR[MEM_76_PFLS_PFLASH_PFCRI_COUNT];          /**< Platform Flash Memory Configuration 0..Platform Flash Memory Configuration 2, array offset: 0x0, array step: 0x4 */
  uint8                 RESERVED_0[4];
  volatile uint32       PFCR4;                             /**< Platform Flash Memory Configuration 4, offset: 0x10 */
  volatile uint32       PFAPR;                             /**< Platform Flash Memory Access Protection, offset: 0x14 */
  uint8                 RESERVED_1[744];
  volatile uint32       PFCPGM_PEADR_L;                    /**< Platform Flash Memory Program Erase Address Logical, offset: 0x300 */
  volatile const uint32 PFCPGM_PEADR_P;                    /**< Platform Flash Memory Program Erase Address Physical, offset: 0x304 */
  volatile uint32       PFCPGM_XPEADR_L;                   /**< Platform Flash Memory Express Program Erase Address Logical, offset: 0x308 */
  volatile const uint32 PFCPGM_XPEADR_P;                   /**< Platform Flash Memory Express Program Erase Address Physical, offset: 0x30C */
  uint8                 RESERVED_2[48];
  volatile uint32       PFCBLK_SPELOCK[MEM_76_PFLS_PFLASH_PFCBLKI_SPELOCK_COUNT]; /**< Block n Sector Program Erase Lock, array offset: 0x340, array step: 0x4 */
  uint8                 RESERVED_3[12];
  volatile uint32       PFCBLKU_SPELOCK[MEM_76_PFLS_PFCBLKU_SPELOCK_COUNT]; /**< Block UTEST Sector Program Erase Lock, array offset: 0x358, array step: 0x4 */
  volatile uint32       PFCBLK_SSPELOCK[MEM_76_PFLS_PFLASH_PFCBLKI_SSPELOCK_COUNT]; /**< Block n Super Sector Program Erase Lock, array offset: 0x35C, array step: 0x4 */
  uint8                 RESERVED_4[28];
  volatile uint32       PFCBLK_SETSLOCK[MEM_76_PFLS_PFLASH_PFCBLKI_SETSLOCK_COUNT]; /**< Block n Set Sector Lock, array offset: 0x380, array step: 0x4 */
  uint8                 RESERVED_5[12];
  volatile uint32       PFCBLKU_SETSLOCK[MEM_76_PFLS_PFCBLKU_SETSLOCK_COUNT]; /**< Block UTEST Set Sector Lock, array offset: 0x398, array step: 0x4 */
  volatile uint32       PFCBLK_SSETSLOCK[MEM_76_PFLS_PFLASH_PFCBLKI_SSETSLOCK_COUNT]; /**< Block n Set Super Sector Lock, array offset: 0x39C, array step: 0x4 */
  uint8                 RESERVED_6[28];
  volatile const uint32 PFCBLK_LOCKMASTER_S[MEM_76_PFLS_PFLASH_PFCBLKI_LOCKMASTER_S_COUNT][MEM_76_PFLS_PFLASH_PFCBLKI_LOCKMASTER_S_PFCBLKI_LOCKMASTER_SJ_COUNT]; /**< Block a Lock Master Sector b, array offset: 0x3C0, array step: index*0x20, index2*0x4 */
  uint8                 RESERVED_7[96];
  volatile const uint32 PFCBLKU_LOCKMASTER_S[MEM_76_PFLS_PFCBLKU_LOCKMASTER_S_COUNT]; /**< Block UTEST Lock Master Sector, array offset: 0x480, array step: 0x4 */
  struct {                                         /* offset: 0x484, array step: 0x10 */
     volatile const uint32 PFCBLK_LOCKMASTER_SS[MEM_76_PFLS_PFLASH_PFCBLKI_LOCKMASTER_SS_PFCBLKI_LOCKMASTER_SSJ_COUNT];   /**< Block m Lock Master Super Sector n, array offset: 0x484, array step: index*0x10, index2*0x4 */
     uint8                 RESERVED_0[4];
  } PFCBLKI_LOCKMASTER_SS[MEM_76_PFLS_PFLASH_PFCBLKI_LOCKMASTER_SS_COUNT];
} PFLASH_Type, *PFLASH_MemMapPtr;
