YUNSUNGWOONG/rtu_S32K312_R44-24.07.1_R240724_ARMGCC/Static_Code/Modules/Mem_R44/arch/delivery/inc/Mem_76_Pfls_Regs.h
/*******************************************************************************
**                      Macro definition                                      **
********************************************************************************/

/* FLASH - Peripheral instance base addresses */
/** Peripheral FLASH base address */
#define MEM_76_PFLS_FLASH_BASE                            (0x402EC000u)
/** Peripheral FLASH base pointer */
#define MEM_76_PFLS_FLASH                                 ((FLASH_Type *)MEM_76_PFLS_FLASH_BASE)
/** Array initializer of FLASH peripheral base addresses */
#define MEM_76_PFLS_FLASH_BASE_ADDRS                      { MEM_76_PFLS_FLASH_BASE }
/** Array initializer of FLASH peripheral base pointers */
#define MEM_76_PFLS_FLASH_BASE_PTRS                       { MEM_76_PFLS_FLASH }

/* PFLASH - Peripheral instance base addresses */
/** Peripheral PFLASH base address */
#define MEM_76_PFLS_PFLASH_BASE                           (0x40268000u)
/** Peripheral PFLASH base pointer */
#define MEM_76_PFLS_PFLASH                                ((PFLASH_Type *)MEM_76_PFLS_PFLASH_BASE)
/** Array initializer of PFLASH peripheral base addresses */
#define MEM_76_PFLS_PFLASH_BASE_ADDRS                     { MEM_76_PFLS_PFLASH_BASE }
/** Array initializer of PFLASH peripheral base pointers */
#define MEM_76_PFLS_PFLASH_BASE_PTRS                      { MEM_76_PFLS_PFLASH }

/* ----------------------------------------------------------------------------
   -- FLASH Register Masks - Embedded Flash Memory
   ---------------------------------------------------------------------------- */

/*!
 * @addtogroup FLASH_Register_Masks FLASH Register Masks
 * @{
 */

/*! @name MCR - Module Configuration */
/*! @{ */

#define MEM_76_PFLS_FLASH_MCR_EHV_MASK                       (0x1U)
#define MEM_76_PFLS_FLASH_MCR_EHV_SHIFT                      (0U)
#define MEM_76_PFLS_FLASH_MCR_EHV_WIDTH                      (1U)
#define MEM_76_PFLS_FLASH_MCR_EHV(x)                         (((uint32_t)(((uint32_t)(x)) << FLASH_MCR_EHV_SHIFT)) & FLASH_MCR_EHV_MASK)

#define MEM_76_PFLS_FLASH_MCR_ERS_MASK                       (0x10U)
#define MEM_76_PFLS_FLASH_MCR_ERS_SHIFT                      (4U)
#define MEM_76_PFLS_FLASH_MCR_ERS_WIDTH                      (1U)
#define MEM_76_PFLS_FLASH_MCR_ERS(x)                         (((uint32_t)(((uint32_t)(x)) << FLASH_MCR_ERS_SHIFT)) & FLASH_MCR_ERS_MASK)

#define MEM_76_PFLS_FLASH_MCR_ESS_MASK                       (0x20U)
#define MEM_76_PFLS_FLASH_MCR_ESS_SHIFT                      (5U)
#define MEM_76_PFLS_FLASH_MCR_ESS_WIDTH                      (1U)
#define MEM_76_PFLS_FLASH_MCR_ESS(x)                         (((uint32_t)(((uint32_t)(x)) << FLASH_MCR_ESS_SHIFT)) & FLASH_MCR_ESS_MASK)

#define MEM_76_PFLS_FLASH_MCR_PGM_MASK                       (0x100U)
#define MEM_76_PFLS_FLASH_MCR_PGM_SHIFT                      (8U)
#define MEM_76_PFLS_FLASH_MCR_PGM_WIDTH                      (1U)
#define MEM_76_PFLS_FLASH_MCR_PGM(x)                         (((uint32_t)(((uint32_t)(x)) << FLASH_MCR_PGM_SHIFT)) & FLASH_MCR_PGM_MASK)

#define MEM_76_PFLS_FLASH_MCR_WDIE_MASK                      (0x1000U)
#define MEM_76_PFLS_FLASH_MCR_WDIE_SHIFT                     (12U)
#define MEM_76_PFLS_FLASH_MCR_WDIE_WIDTH                     (1U)
#define MEM_76_PFLS_FLASH_MCR_WDIE(x)                        (((uint32_t)(((uint32_t)(x)) << FLASH_MCR_WDIE_SHIFT)) & FLASH_MCR_WDIE_MASK)

#define MEM_76_PFLS_FLASH_MCR_PECIE_MASK                     (0x8000U)
#define MEM_76_PFLS_FLASH_MCR_PECIE_SHIFT                    (15U)
#define MEM_76_PFLS_FLASH_MCR_PECIE_WIDTH                    (1U)
#define MEM_76_PFLS_FLASH_MCR_PECIE(x)                       (((uint32_t)(((uint32_t)(x)) << FLASH_MCR_PECIE_SHIFT)) & FLASH_MCR_PECIE_MASK)

#define MEM_76_PFLS_FLASH_MCR_PEID_MASK                      (0xFF0000U)
#define MEM_76_PFLS_FLASH_MCR_PEID_SHIFT                     (16U)
#define MEM_76_PFLS_FLASH_MCR_PEID_WIDTH                     (8U)
#define MEM_76_PFLS_FLASH_MCR_PEID(x)                        (((uint32_t)(((uint32_t)(x)) << FLASH_MCR_PEID_SHIFT)) & FLASH_MCR_PEID_MASK)
/*! @} */

/*! @name MCRS - Module Configuration Status */
/*! @{ */

#define MEM_76_PFLS_FLASH_MCRS_RE_MASK                       (0x1U)
#define MEM_76_PFLS_FLASH_MCRS_RE_SHIFT                      (0U)
#define MEM_76_PFLS_FLASH_MCRS_RE_WIDTH                      (1U)
#define MEM_76_PFLS_FLASH_MCRS_RE(x)                         (((uint32_t)(((uint32_t)(x)) << FLASH_MCRS_RE_SHIFT)) & FLASH_MCRS_RE_MASK)

#define MEM_76_PFLS_FLASH_MCRS_TSPELOCK_MASK                 (0x100U)
#define MEM_76_PFLS_FLASH_MCRS_TSPELOCK_SHIFT                (8U)
#define MEM_76_PFLS_FLASH_MCRS_TSPELOCK_WIDTH                (1U)
#define MEM_76_PFLS_FLASH_MCRS_TSPELOCK(x)                   (((uint32_t)(((uint32_t)(x)) << FLASH_MCRS_TSPELOCK_SHIFT)) & FLASH_MCRS_TSPELOCK_MASK)

#define MEM_76_PFLS_FLASH_MCRS_EPEG_MASK                     (0x200U)
#define MEM_76_PFLS_FLASH_MCRS_EPEG_SHIFT                    (9U)
#define MEM_76_PFLS_FLASH_MCRS_EPEG_WIDTH                    (1U)
#define MEM_76_PFLS_FLASH_MCRS_EPEG(x)                       (((uint32_t)(((uint32_t)(x)) << FLASH_MCRS_EPEG_SHIFT)) & FLASH_MCRS_EPEG_MASK)

#define MEM_76_PFLS_FLASH_MCRS_WDI_MASK                      (0x1000U)
#define MEM_76_PFLS_FLASH_MCRS_WDI_SHIFT                     (12U)
#define MEM_76_PFLS_FLASH_MCRS_WDI_WIDTH                     (1U)
#define MEM_76_PFLS_FLASH_MCRS_WDI(x)                        (((uint32_t)(((uint32_t)(x)) << FLASH_MCRS_WDI_SHIFT)) & FLASH_MCRS_WDI_MASK)

#define MEM_76_PFLS_FLASH_MCRS_PEG_MASK                      (0x4000U)
#define MEM_76_PFLS_FLASH_MCRS_PEG_SHIFT                     (14U)
#define MEM_76_PFLS_FLASH_MCRS_PEG_WIDTH                     (1U)
#define MEM_76_PFLS_FLASH_MCRS_PEG(x)                        (((uint32_t)(((uint32_t)(x)) << FLASH_MCRS_PEG_SHIFT)) & FLASH_MCRS_PEG_MASK)

#define MEM_76_PFLS_FLASH_MCRS_DONE_MASK                     (0x8000U)
#define MEM_76_PFLS_FLASH_MCRS_DONE_SHIFT                    (15U)
#define MEM_76_PFLS_FLASH_MCRS_DONE_WIDTH                    (1U)
#define MEM_76_PFLS_FLASH_MCRS_DONE(x)                       (((uint32_t)(((uint32_t)(x)) << FLASH_MCRS_DONE_SHIFT)) & FLASH_MCRS_DONE_MASK)

#define MEM_76_PFLS_FLASH_MCRS_PES_MASK                      (0x10000U)
#define MEM_76_PFLS_FLASH_MCRS_PES_SHIFT                     (16U)
#define MEM_76_PFLS_FLASH_MCRS_PES_WIDTH                     (1U)
#define MEM_76_PFLS_FLASH_MCRS_PES(x)                        (((uint32_t)(((uint32_t)(x)) << FLASH_MCRS_PES_SHIFT)) & FLASH_MCRS_PES_MASK)

#define MEM_76_PFLS_FLASH_MCRS_PEP_MASK                      (0x20000U)
#define MEM_76_PFLS_FLASH_MCRS_PEP_SHIFT                     (17U)
#define MEM_76_PFLS_FLASH_MCRS_PEP_WIDTH                     (1U)
#define MEM_76_PFLS_FLASH_MCRS_PEP(x)                        (((uint32_t)(((uint32_t)(x)) << FLASH_MCRS_PEP_SHIFT)) & FLASH_MCRS_PEP_MASK)

#define MEM_76_PFLS_FLASH_MCRS_RWE_MASK                      (0x100000U)
#define MEM_76_PFLS_FLASH_MCRS_RWE_SHIFT                     (20U)
#define MEM_76_PFLS_FLASH_MCRS_RWE_WIDTH                     (1U)
#define MEM_76_PFLS_FLASH_MCRS_RWE(x)                        (((uint32_t)(((uint32_t)(x)) << FLASH_MCRS_RWE_SHIFT)) & FLASH_MCRS_RWE_MASK)

#define MEM_76_PFLS_FLASH_MCRS_RRE_MASK                      (0x1000000U)
#define MEM_76_PFLS_FLASH_MCRS_RRE_SHIFT                     (24U)
#define MEM_76_PFLS_FLASH_MCRS_RRE_WIDTH                     (1U)
#define MEM_76_PFLS_FLASH_MCRS_RRE(x)                        (((uint32_t)(((uint32_t)(x)) << FLASH_MCRS_RRE_SHIFT)) & FLASH_MCRS_RRE_MASK)

