YUNSUNGWOONG/rtu_S32K312_R44-24.07.1_R240724_ARMGCC/Static_Code/Modules/Mem_R44/arch/delivery/inc/Mem_76_Pfls_Regs.h
#define MEM_76_PFLS_FLASH_MCRS_RVE_MASK                      (0x2000000U)
#define MEM_76_PFLS_FLASH_MCRS_RVE_SHIFT                     (25U)
#define MEM_76_PFLS_FLASH_MCRS_RVE_WIDTH                     (1U)
#define MEM_76_PFLS_FLASH_MCRS_RVE(x)                        (((uint32_t)(((uint32_t)(x)) << FLASH_MCRS_RVE_SHIFT)) & FLASH_MCRS_RVE_MASK)

#define MEM_76_PFLS_FLASH_MCRS_EEE_MASK                      (0x10000000U)
#define MEM_76_PFLS_FLASH_MCRS_EEE_SHIFT                     (28U)
#define MEM_76_PFLS_FLASH_MCRS_EEE_WIDTH                     (1U)
#define MEM_76_PFLS_FLASH_MCRS_EEE(x)                        (((uint32_t)(((uint32_t)(x)) << FLASH_MCRS_EEE_SHIFT)) & FLASH_MCRS_EEE_MASK)

#define MEM_76_PFLS_FLASH_MCRS_AEE_MASK                      (0x20000000U)
#define MEM_76_PFLS_FLASH_MCRS_AEE_SHIFT                     (29U)
#define MEM_76_PFLS_FLASH_MCRS_AEE_WIDTH                     (1U)
#define MEM_76_PFLS_FLASH_MCRS_AEE(x)                        (((uint32_t)(((uint32_t)(x)) << FLASH_MCRS_AEE_SHIFT)) & FLASH_MCRS_AEE_MASK)

#define MEM_76_PFLS_FLASH_MCRS_SBC_MASK                      (0x40000000U)
#define MEM_76_PFLS_FLASH_MCRS_SBC_SHIFT                     (30U)
#define MEM_76_PFLS_FLASH_MCRS_SBC_WIDTH                     (1U)
#define MEM_76_PFLS_FLASH_MCRS_SBC(x)                        (((uint32_t)(((uint32_t)(x)) << FLASH_MCRS_SBC_SHIFT)) & FLASH_MCRS_SBC_MASK)

#define MEM_76_PFLS_FLASH_MCRS_EER_MASK                      (0x80000000U)
#define MEM_76_PFLS_FLASH_MCRS_EER_SHIFT                     (31U)
#define MEM_76_PFLS_FLASH_MCRS_EER_WIDTH                     (1U)
#define MEM_76_PFLS_FLASH_MCRS_EER(x)                        (((uint32_t)(((uint32_t)(x)) << FLASH_MCRS_EER_SHIFT)) & FLASH_MCRS_EER_MASK)
/*! @} */

/*! @name MCRE - Extended Module Configuration */
/*! @{ */

#define MEM_76_PFLS_FLASH_MCRE_n256K_MASK                    (0xC0U)
#define MEM_76_PFLS_FLASH_MCRE_n256K_SHIFT                   (6U)
#define MEM_76_PFLS_FLASH_MCRE_n256K_WIDTH                   (2U)
#define MEM_76_PFLS_FLASH_MCRE_n256K(x)                      (((uint32_t)(((uint32_t)(x)) << FLASH_MCRE_n256K_SHIFT)) & FLASH_MCRE_n256K_MASK)

#define MEM_76_PFLS_FLASH_MCRE_n512K_MASK                    (0xC000U)
#define MEM_76_PFLS_FLASH_MCRE_n512K_SHIFT                   (14U)
#define MEM_76_PFLS_FLASH_MCRE_n512K_WIDTH                   (2U)
#define MEM_76_PFLS_FLASH_MCRE_n512K(x)                      (((uint32_t)(((uint32_t)(x)) << FLASH_MCRE_n512K_SHIFT)) & FLASH_MCRE_n512K_MASK)

#define MEM_76_PFLS_FLASH_MCRE_n1M_MASK                      (0xE00000U)
#define MEM_76_PFLS_FLASH_MCRE_n1M_SHIFT                     (21U)
#define MEM_76_PFLS_FLASH_MCRE_n1M_WIDTH                     (3U)
#define MEM_76_PFLS_FLASH_MCRE_n1M(x)                        (((uint32_t)(((uint32_t)(x)) << FLASH_MCRE_n1M_SHIFT)) & FLASH_MCRE_n1M_MASK)

#define MEM_76_PFLS_FLASH_MCRE_n2M_MASK                      (0xE0000000U)
#define MEM_76_PFLS_FLASH_MCRE_n2M_SHIFT                     (29U)
#define MEM_76_PFLS_FLASH_MCRE_n2M_WIDTH                     (3U)
#define MEM_76_PFLS_FLASH_MCRE_n2M(x)                        (((uint32_t)(((uint32_t)(x)) << FLASH_MCRE_n2M_SHIFT)) & FLASH_MCRE_n2M_MASK)
/*! @} */

/*! @name CTL - Module Control */
/*! @{ */

#define MEM_76_PFLS_FLASH_CTL_RWSC_MASK                      (0x1F00U)
#define MEM_76_PFLS_FLASH_CTL_RWSC_SHIFT                     (8U)
#define MEM_76_PFLS_FLASH_CTL_RWSC_WIDTH                     (5U)
#define MEM_76_PFLS_FLASH_CTL_RWSC(x)                        (((uint32_t)(((uint32_t)(x)) << FLASH_CTL_RWSC_SHIFT)) & FLASH_CTL_RWSC_MASK)

#define MEM_76_PFLS_FLASH_CTL_RWSL_MASK                      (0x8000U)
#define MEM_76_PFLS_FLASH_CTL_RWSL_SHIFT                     (15U)
#define MEM_76_PFLS_FLASH_CTL_RWSL_WIDTH                     (1U)
#define MEM_76_PFLS_FLASH_CTL_RWSL(x)                        (((uint32_t)(((uint32_t)(x)) << FLASH_CTL_RWSL_SHIFT)) & FLASH_CTL_RWSL_MASK)
/*! @} */

/*! @name ADR - Address */
/*! @{ */

#define MEM_76_PFLS_FLASH_ADR_ADDR_MASK                      (0x7FFFEU)
#define MEM_76_PFLS_FLASH_ADR_ADDR_SHIFT                     (1U)
#define MEM_76_PFLS_FLASH_ADR_ADDR_WIDTH                     (18U)
#define MEM_76_PFLS_FLASH_ADR_ADDR(x)                        (((uint32_t)(((uint32_t)(x)) << FLASH_ADR_ADDR_SHIFT)) & FLASH_ADR_ADDR_MASK)

#define MEM_76_PFLS_FLASH_ADR_A0_MASK                        (0x80000U)
#define MEM_76_PFLS_FLASH_ADR_A0_SHIFT                       (19U)
#define MEM_76_PFLS_FLASH_ADR_A0_WIDTH                       (1U)
#define MEM_76_PFLS_FLASH_ADR_A0(x)                          (((uint32_t)(((uint32_t)(x)) << FLASH_ADR_A0_SHIFT)) & FLASH_ADR_A0_MASK)

#define MEM_76_PFLS_FLASH_ADR_A1_MASK                        (0x100000U)
#define MEM_76_PFLS_FLASH_ADR_A1_SHIFT                       (20U)
#define MEM_76_PFLS_FLASH_ADR_A1_WIDTH                       (1U)
#define MEM_76_PFLS_FLASH_ADR_A1(x)                          (((uint32_t)(((uint32_t)(x)) << FLASH_ADR_A1_SHIFT)) & FLASH_ADR_A1_MASK)

#define MEM_76_PFLS_FLASH_ADR_A2_MASK                        (0x200000U)
#define MEM_76_PFLS_FLASH_ADR_A2_SHIFT                       (21U)
#define MEM_76_PFLS_FLASH_ADR_A2_WIDTH                       (1U)
#define MEM_76_PFLS_FLASH_ADR_A2(x)                          (((uint32_t)(((uint32_t)(x)) << FLASH_ADR_A2_SHIFT)) & FLASH_ADR_A2_MASK)

#define MEM_76_PFLS_FLASH_ADR_A5_MASK                        (0x1000000U)
#define MEM_76_PFLS_FLASH_ADR_A5_SHIFT                       (24U)
#define MEM_76_PFLS_FLASH_ADR_A5_WIDTH                       (1U)
#define MEM_76_PFLS_FLASH_ADR_A5(x)                          (((uint32_t)(((uint32_t)(x)) << FLASH_ADR_A5_SHIFT)) & FLASH_ADR_A5_MASK)

#define MEM_76_PFLS_FLASH_ADR_SAD_MASK                       (0x80000000U)
#define MEM_76_PFLS_FLASH_ADR_SAD_SHIFT                      (31U)
#define MEM_76_PFLS_FLASH_ADR_SAD_WIDTH                      (1U)
#define MEM_76_PFLS_FLASH_ADR_SAD(x)                         (((uint32_t)(((uint32_t)(x)) << FLASH_ADR_SAD_SHIFT)) & FLASH_ADR_SAD_MASK)
/*! @} */

/*! @name PEADR - Program and Erase Address */
/*! @{ */

