YUNSUNGWOONG/rtu_S32K312_R44-24.07.1_R240724_ARMGCC/Static_Code/Modules/Mem_R44/arch/delivery/inc/Mem_76_Pfls_Regs.h
#define MEM_76_PFLS_FLASH_PEADR_PEADDR_MASK                  (0x7FFE0U)
#define MEM_76_PFLS_FLASH_PEADR_PEADDR_SHIFT                 (5U)
#define MEM_76_PFLS_FLASH_PEADR_PEADDR_WIDTH                 (14U)
#define MEM_76_PFLS_FLASH_PEADR_PEADDR(x)                    (((uint32_t)(((uint32_t)(x)) << FLASH_PEADR_PEADDR_SHIFT)) & FLASH_PEADR_PEADDR_MASK)

#define MEM_76_PFLS_FLASH_PEADR_PEA0_MASK                    (0x80000U)
#define MEM_76_PFLS_FLASH_PEADR_PEA0_SHIFT                   (19U)
#define MEM_76_PFLS_FLASH_PEADR_PEA0_WIDTH                   (1U)
#define MEM_76_PFLS_FLASH_PEADR_PEA0(x)                      (((uint32_t)(((uint32_t)(x)) << FLASH_PEADR_PEA0_SHIFT)) & FLASH_PEADR_PEA0_MASK)

#define MEM_76_PFLS_FLASH_PEADR_PEA1_MASK                    (0x100000U)
#define MEM_76_PFLS_FLASH_PEADR_PEA1_SHIFT                   (20U)
#define MEM_76_PFLS_FLASH_PEADR_PEA1_WIDTH                   (1U)
#define MEM_76_PFLS_FLASH_PEADR_PEA1(x)                      (((uint32_t)(((uint32_t)(x)) << FLASH_PEADR_PEA1_SHIFT)) & FLASH_PEADR_PEA1_MASK)

#define MEM_76_PFLS_FLASH_PEADR_PEA2_MASK                    (0x200000U)
#define MEM_76_PFLS_FLASH_PEADR_PEA2_SHIFT                   (21U)
#define MEM_76_PFLS_FLASH_PEADR_PEA2_WIDTH                   (1U)
#define MEM_76_PFLS_FLASH_PEADR_PEA2(x)                      (((uint32_t)(((uint32_t)(x)) << FLASH_PEADR_PEA2_SHIFT)) & FLASH_PEADR_PEA2_MASK)

#define MEM_76_PFLS_FLASH_PEADR_PEA3_MASK                    (0x400000U)
#define MEM_76_PFLS_FLASH_PEADR_PEA3_SHIFT                   (22U)
#define MEM_76_PFLS_FLASH_PEADR_PEA3_WIDTH                   (1U)
#define MEM_76_PFLS_FLASH_PEADR_PEA3(x)                      (((uint32_t)(((uint32_t)(x)) << FLASH_PEADR_PEA3_SHIFT)) & FLASH_PEADR_PEA3_MASK)

#define MEM_76_PFLS_FLASH_PEADR_PEA4_MASK                    (0x800000U)
#define MEM_76_PFLS_FLASH_PEADR_PEA4_SHIFT                   (23U)
#define MEM_76_PFLS_FLASH_PEADR_PEA4_WIDTH                   (1U)
#define MEM_76_PFLS_FLASH_PEADR_PEA4(x)                      (((uint32_t)(((uint32_t)(x)) << FLASH_PEADR_PEA4_SHIFT)) & FLASH_PEADR_PEA4_MASK)

#define MEM_76_PFLS_FLASH_PEADR_PEA5_MASK                    (0x1000000U)
#define MEM_76_PFLS_FLASH_PEADR_PEA5_SHIFT                   (24U)
#define MEM_76_PFLS_FLASH_PEADR_PEA5_WIDTH                   (1U)
#define MEM_76_PFLS_FLASH_PEADR_PEA5(x)                      (((uint32_t)(((uint32_t)(x)) << FLASH_PEADR_PEA5_SHIFT)) & FLASH_PEADR_PEA5_MASK)

#define MEM_76_PFLS_FLASH_PEADR_PEASAD_MASK                  (0x80000000U)
#define MEM_76_PFLS_FLASH_PEADR_PEASAD_SHIFT                 (31U)
#define MEM_76_PFLS_FLASH_PEADR_PEASAD_WIDTH                 (1U)
#define MEM_76_PFLS_FLASH_PEADR_PEASAD(x)                    (((uint32_t)(((uint32_t)(x)) << FLASH_PEADR_PEASAD_SHIFT)) & FLASH_PEADR_PEASAD_MASK)
/*! @} */

/*! @name SPELOCK - Sector Program and Erase Hardware Lock */
/*! @{ */

#define MEM_76_PFLS_FLASH_SPELOCK_SPELOCK_MASK               (0xFFFFFFFFU)
#define MEM_76_PFLS_FLASH_SPELOCK_SPELOCK_SHIFT              (0U)
#define MEM_76_PFLS_FLASH_SPELOCK_SPELOCK_WIDTH              (32U)
#define MEM_76_PFLS_FLASH_SPELOCK_SPELOCK(x)                 (((uint32_t)(((uint32_t)(x)) << FLASH_SPELOCK_SPELOCK_SHIFT)) & FLASH_SPELOCK_SPELOCK_MASK)
/*! @} */

/*! @name SSPELOCK - Super Sector Program and Erase Hardware Lock */
/*! @{ */

#define MEM_76_PFLS_FLASH_SSPELOCK_SSPELOCK_MASK             (0xFFFFFFFU)
#define MEM_76_PFLS_FLASH_SSPELOCK_SSPELOCK_SHIFT            (0U)
#define MEM_76_PFLS_FLASH_SSPELOCK_SSPELOCK_WIDTH            (28U)
#define MEM_76_PFLS_FLASH_SSPELOCK_SSPELOCK(x)               (((uint32_t)(((uint32_t)(x)) << FLASH_SSPELOCK_SSPELOCK_SHIFT)) & FLASH_SSPELOCK_SSPELOCK_MASK)
/*! @} */

/*! @name XSPELOCK - Express Sector Program and Erase Hardware Lock */
/*! @{ */

#define MEM_76_PFLS_FLASH_XSPELOCK_XSPELOCK_MASK             (0xFFFFFFFFU)
#define MEM_76_PFLS_FLASH_XSPELOCK_XSPELOCK_SHIFT            (0U)
#define MEM_76_PFLS_FLASH_XSPELOCK_XSPELOCK_WIDTH            (32U)
#define MEM_76_PFLS_FLASH_XSPELOCK_XSPELOCK(x)               (((uint32_t)(((uint32_t)(x)) << FLASH_XSPELOCK_XSPELOCK_SHIFT)) & FLASH_XSPELOCK_XSPELOCK_MASK)
/*! @} */

/*! @name XSSPELOCK - Express Super Sector Program and Erase Hardware Lock */
/*! @{ */

#define MEM_76_PFLS_FLASH_XSSPELOCK_XSSPELOCK_MASK           (0xFFFFFFFU)
#define MEM_76_PFLS_FLASH_XSSPELOCK_XSSPELOCK_SHIFT          (0U)
#define MEM_76_PFLS_FLASH_XSSPELOCK_XSSPELOCK_WIDTH          (28U)
#define MEM_76_PFLS_FLASH_XSSPELOCK_XSSPELOCK(x)             (((uint32_t)(((uint32_t)(x)) << FLASH_XSSPELOCK_XSSPELOCK_SHIFT)) & FLASH_XSSPELOCK_XSSPELOCK_MASK)
/*! @} */

/*! @name TMD - Test Mode Disable Password Check */
/*! @{ */

#define MEM_76_PFLS_FLASH_TMD_PWD_MASK                       (0xFFFFFFFFU)
#define MEM_76_PFLS_FLASH_TMD_PWD_SHIFT                      (0U)
#define MEM_76_PFLS_FLASH_TMD_PWD_WIDTH                      (32U)
#define MEM_76_PFLS_FLASH_TMD_PWD(x)                         (((uint32_t)(((uint32_t)(x)) << FLASH_TMD_PWD_SHIFT)) & FLASH_TMD_PWD_MASK)
/*! @} */

/*! @name UT0 - UTest 0 */
/*! @{ */

#define MEM_76_PFLS_FLASH_UT0_AID_MASK                       (0x1U)
#define MEM_76_PFLS_FLASH_UT0_AID_SHIFT                      (0U)
#define MEM_76_PFLS_FLASH_UT0_AID_WIDTH                      (1U)
#define MEM_76_PFLS_FLASH_UT0_AID(x)                         (((uint32_t)(((uint32_t)(x)) << FLASH_UT0_AID_SHIFT)) & FLASH_UT0_AID_MASK)

#define MEM_76_PFLS_FLASH_UT0_AIE_MASK                       (0x2U)
#define MEM_76_PFLS_FLASH_UT0_AIE_SHIFT                      (1U)
#define MEM_76_PFLS_FLASH_UT0_AIE_WIDTH                      (1U)
#define MEM_76_PFLS_FLASH_UT0_AIE(x)                         (((uint32_t)(((uint32_t)(x)) << FLASH_UT0_AIE_SHIFT)) & FLASH_UT0_AIE_MASK)

#define MEM_76_PFLS_FLASH_UT0_AIS_MASK                       (0x4U)
#define MEM_76_PFLS_FLASH_UT0_AIS_SHIFT                      (2U)
#define MEM_76_PFLS_FLASH_UT0_AIS_WIDTH                      (1U)
#define MEM_76_PFLS_FLASH_UT0_AIS(x)                         (((uint32_t)(((uint32_t)(x)) << FLASH_UT0_AIS_SHIFT)) & FLASH_UT0_AIS_MASK)

#define MEM_76_PFLS_FLASH_UT0_MRV_MASK                       (0x10U)
#define MEM_76_PFLS_FLASH_UT0_MRV_SHIFT                      (4U)
#define MEM_76_PFLS_FLASH_UT0_MRV_WIDTH                      (1U)
#define MEM_76_PFLS_FLASH_UT0_MRV(x)                         (((uint32_t)(((uint32_t)(x)) << FLASH_UT0_MRV_SHIFT)) & FLASH_UT0_MRV_MASK)

#define MEM_76_PFLS_FLASH_UT0_MRE_MASK                       (0x20U)
#define MEM_76_PFLS_FLASH_UT0_MRE_SHIFT                      (5U)
#define MEM_76_PFLS_FLASH_UT0_MRE_WIDTH                      (1U)
#define MEM_76_PFLS_FLASH_UT0_MRE(x)                         (((uint32_t)(((uint32_t)(x)) << FLASH_UT0_MRE_SHIFT)) & FLASH_UT0_MRE_MASK)

#define MEM_76_PFLS_FLASH_UT0_AISUS_MASK                     (0x40U)
#define MEM_76_PFLS_FLASH_UT0_AISUS_SHIFT                    (6U)
#define MEM_76_PFLS_FLASH_UT0_AISUS_WIDTH                    (1U)
#define MEM_76_PFLS_FLASH_UT0_AISUS(x)                       (((uint32_t)(((uint32_t)(x)) << FLASH_UT0_AISUS_SHIFT)) & FLASH_UT0_AISUS_MASK)

