YUNSUNGWOONG/rtu_S32K312_R44-24.07.1_R240724_ARMGCC/Static_Code/Modules/Mem_R44/arch/delivery/inc/Mem_76_Pfls_Regs.h
#define MEM_76_PFLS_FLASH_UT0_AIBPE_MASK                     (0x100U)
#define MEM_76_PFLS_FLASH_UT0_AIBPE_SHIFT                    (8U)
#define MEM_76_PFLS_FLASH_UT0_AIBPE_WIDTH                    (1U)
#define MEM_76_PFLS_FLASH_UT0_AIBPE(x)                       (((uint32_t)(((uint32_t)(x)) << FLASH_UT0_AIBPE_SHIFT)) & FLASH_UT0_AIBPE_MASK)

#define MEM_76_PFLS_FLASH_UT0_NAIBP_MASK                     (0x200U)
#define MEM_76_PFLS_FLASH_UT0_NAIBP_SHIFT                    (9U)
#define MEM_76_PFLS_FLASH_UT0_NAIBP_WIDTH                    (1U)
#define MEM_76_PFLS_FLASH_UT0_NAIBP(x)                       (((uint32_t)(((uint32_t)(x)) << FLASH_UT0_NAIBP_SHIFT)) & FLASH_UT0_NAIBP_MASK)

#define MEM_76_PFLS_FLASH_UT0_EIE_MASK                       (0x1000U)
#define MEM_76_PFLS_FLASH_UT0_EIE_SHIFT                      (12U)
#define MEM_76_PFLS_FLASH_UT0_EIE_WIDTH                      (1U)
#define MEM_76_PFLS_FLASH_UT0_EIE(x)                         (((uint32_t)(((uint32_t)(x)) << FLASH_UT0_EIE_SHIFT)) & FLASH_UT0_EIE_MASK)

#define MEM_76_PFLS_FLASH_UT0_EDIE_MASK                      (0x2000U)
#define MEM_76_PFLS_FLASH_UT0_EDIE_SHIFT                     (13U)
#define MEM_76_PFLS_FLASH_UT0_EDIE_WIDTH                     (1U)
#define MEM_76_PFLS_FLASH_UT0_EDIE(x)                        (((uint32_t)(((uint32_t)(x)) << FLASH_UT0_EDIE_SHIFT)) & FLASH_UT0_EDIE_MASK)

#define MEM_76_PFLS_FLASH_UT0_AEIE_MASK                      (0x4000U)
#define MEM_76_PFLS_FLASH_UT0_AEIE_SHIFT                     (14U)
#define MEM_76_PFLS_FLASH_UT0_AEIE_WIDTH                     (1U)
#define MEM_76_PFLS_FLASH_UT0_AEIE(x)                        (((uint32_t)(((uint32_t)(x)) << FLASH_UT0_AEIE_SHIFT)) & FLASH_UT0_AEIE_MASK)

#define MEM_76_PFLS_FLASH_UT0_RRIE_MASK                      (0x8000U)
#define MEM_76_PFLS_FLASH_UT0_RRIE_SHIFT                     (15U)
#define MEM_76_PFLS_FLASH_UT0_RRIE_WIDTH                     (1U)
#define MEM_76_PFLS_FLASH_UT0_RRIE(x)                        (((uint32_t)(((uint32_t)(x)) << FLASH_UT0_RRIE_SHIFT)) & FLASH_UT0_RRIE_MASK)

#define MEM_76_PFLS_FLASH_UT0_SBCE_MASK                      (0x40000000U)
#define MEM_76_PFLS_FLASH_UT0_SBCE_SHIFT                     (30U)
#define MEM_76_PFLS_FLASH_UT0_SBCE_WIDTH                     (1U)
#define MEM_76_PFLS_FLASH_UT0_SBCE(x)                        (((uint32_t)(((uint32_t)(x)) << FLASH_UT0_SBCE_SHIFT)) & FLASH_UT0_SBCE_MASK)

#define MEM_76_PFLS_FLASH_UT0_UTE_MASK                       (0x80000000U)
#define MEM_76_PFLS_FLASH_UT0_UTE_SHIFT                      (31U)
#define MEM_76_PFLS_FLASH_UT0_UTE_WIDTH                      (1U)
#define MEM_76_PFLS_FLASH_UT0_UTE(x)                         (((uint32_t)(((uint32_t)(x)) << FLASH_UT0_UTE_SHIFT)) & FLASH_UT0_UTE_MASK)
/*! @} */

/*! @name UM - UMISRn */
/*! @{ */

#define MEM_76_PFLS_FLASH_UM_MISR_MASK                       (0xFFFFFFFFU)
#define MEM_76_PFLS_FLASH_UM_MISR_SHIFT                      (0U)
#define MEM_76_PFLS_FLASH_UM_MISR_WIDTH                      (32U)
#define MEM_76_PFLS_FLASH_UM_MISR(x)                         (((uint32_t)(((uint32_t)(x)) << FLASH_UM_MISR_SHIFT)) & FLASH_UM_MISR_MASK)
/*! @} */

/*! @name UM9 - UMISR9 */
/*! @{ */

#define MEM_76_PFLS_FLASH_UM9_MISR_MASK                      (0x1U)
#define MEM_76_PFLS_FLASH_UM9_MISR_SHIFT                     (0U)
#define MEM_76_PFLS_FLASH_UM9_MISR_WIDTH                     (1U)
#define MEM_76_PFLS_FLASH_UM9_MISR(x)                        (((uint32_t)(((uint32_t)(x)) << FLASH_UM9_MISR_SHIFT)) & FLASH_UM9_MISR_MASK)
/*! @} */

/*! @name UD0 - UTest Data 0 */
/*! @{ */

#define MEM_76_PFLS_FLASH_UD0_EDATA_MASK                     (0xFFFFFFFFU)
#define MEM_76_PFLS_FLASH_UD0_EDATA_SHIFT                    (0U)
#define MEM_76_PFLS_FLASH_UD0_EDATA_WIDTH                    (32U)
#define MEM_76_PFLS_FLASH_UD0_EDATA(x)                       (((uint32_t)(((uint32_t)(x)) << FLASH_UD0_EDATA_SHIFT)) & FLASH_UD0_EDATA_MASK)
/*! @} */

/*! @name UD1 - UTest Data 1 */
/*! @{ */

#define MEM_76_PFLS_FLASH_UD1_EDATA_MASK                     (0xFFFFFFFFU)
#define MEM_76_PFLS_FLASH_UD1_EDATA_SHIFT                    (0U)
#define MEM_76_PFLS_FLASH_UD1_EDATA_WIDTH                    (32U)
#define MEM_76_PFLS_FLASH_UD1_EDATA(x)                       (((uint32_t)(((uint32_t)(x)) << FLASH_UD1_EDATA_SHIFT)) & FLASH_UD1_EDATA_MASK)
/*! @} */

/*! @name UD2 - UTest Data 2 */
/*! @{ */

#define MEM_76_PFLS_FLASH_UD2_EDATAC_MASK                    (0xFFU)
#define MEM_76_PFLS_FLASH_UD2_EDATAC_SHIFT                   (0U)
#define MEM_76_PFLS_FLASH_UD2_EDATAC_WIDTH                   (8U)
#define MEM_76_PFLS_FLASH_UD2_EDATAC(x)                      (((uint32_t)(((uint32_t)(x)) << FLASH_UD2_EDATAC_SHIFT)) & FLASH_UD2_EDATAC_MASK)

#define MEM_76_PFLS_FLASH_UD2_ED0_MASK                       (0x1000000U)
#define MEM_76_PFLS_FLASH_UD2_ED0_SHIFT                      (24U)
#define MEM_76_PFLS_FLASH_UD2_ED0_WIDTH                      (1U)
#define MEM_76_PFLS_FLASH_UD2_ED0(x)                         (((uint32_t)(((uint32_t)(x)) << FLASH_UD2_ED0_SHIFT)) & FLASH_UD2_ED0_MASK)

#define MEM_76_PFLS_FLASH_UD2_ED1_MASK                       (0x2000000U)
#define MEM_76_PFLS_FLASH_UD2_ED1_SHIFT                      (25U)
#define MEM_76_PFLS_FLASH_UD2_ED1_WIDTH                      (1U)
#define MEM_76_PFLS_FLASH_UD2_ED1(x)                         (((uint32_t)(((uint32_t)(x)) << FLASH_UD2_ED1_SHIFT)) & FLASH_UD2_ED1_MASK)

#define MEM_76_PFLS_FLASH_UD2_ED2_MASK                       (0x4000000U)
#define MEM_76_PFLS_FLASH_UD2_ED2_SHIFT                      (26U)
#define MEM_76_PFLS_FLASH_UD2_ED2_WIDTH                      (1U)
#define MEM_76_PFLS_FLASH_UD2_ED2(x)                         (((uint32_t)(((uint32_t)(x)) << FLASH_UD2_ED2_SHIFT)) & FLASH_UD2_ED2_MASK)

#define MEM_76_PFLS_FLASH_UD2_ED3_MASK                       (0x8000000U)
#define MEM_76_PFLS_FLASH_UD2_ED3_SHIFT                      (27U)
#define MEM_76_PFLS_FLASH_UD2_ED3_WIDTH                      (1U)
#define MEM_76_PFLS_FLASH_UD2_ED3(x)                         (((uint32_t)(((uint32_t)(x)) << FLASH_UD2_ED3_SHIFT)) & FLASH_UD2_ED3_MASK)
/*! @} */

/*! @name UD3 - UTest Data 3 */
/*! @{ */

