YUNSUNGWOONG/rtu_S32K312_R44-24.07.1_R240724_ARMGCC/Static_Code/Modules/Mem_R44/arch/delivery/inc/Mem_76_Pfls_Regs.h
#define MEM_76_PFLS_FLASH_UD3_EDDATA_MASK                    (0xFFFFFFFFU)
#define MEM_76_PFLS_FLASH_UD3_EDDATA_SHIFT                   (0U)
#define MEM_76_PFLS_FLASH_UD3_EDDATA_WIDTH                   (32U)
#define MEM_76_PFLS_FLASH_UD3_EDDATA(x)                      (((uint32_t)(((uint32_t)(x)) << FLASH_UD3_EDDATA_SHIFT)) & FLASH_UD3_EDDATA_MASK)
/*! @} */

/*! @name UD4 - UTest Data 4 */
/*! @{ */

#define MEM_76_PFLS_FLASH_UD4_EDDATA_MASK                    (0xFFFFFFFFU)
#define MEM_76_PFLS_FLASH_UD4_EDDATA_SHIFT                   (0U)
#define MEM_76_PFLS_FLASH_UD4_EDDATA_WIDTH                   (32U)
#define MEM_76_PFLS_FLASH_UD4_EDDATA(x)                      (((uint32_t)(((uint32_t)(x)) << FLASH_UD4_EDDATA_SHIFT)) & FLASH_UD4_EDDATA_MASK)
/*! @} */

/*! @name UD5 - UTest Data 5 */
/*! @{ */

#define MEM_76_PFLS_FLASH_UD5_EDDATAC_MASK                   (0xFFU)
#define MEM_76_PFLS_FLASH_UD5_EDDATAC_SHIFT                  (0U)
#define MEM_76_PFLS_FLASH_UD5_EDDATAC_WIDTH                  (8U)
#define MEM_76_PFLS_FLASH_UD5_EDDATAC(x)                     (((uint32_t)(((uint32_t)(x)) << FLASH_UD5_EDDATAC_SHIFT)) & FLASH_UD5_EDDATAC_MASK)

#define MEM_76_PFLS_FLASH_UD5_EDD0_MASK                      (0x1000000U)
#define MEM_76_PFLS_FLASH_UD5_EDD0_SHIFT                     (24U)
#define MEM_76_PFLS_FLASH_UD5_EDD0_WIDTH                     (1U)
#define MEM_76_PFLS_FLASH_UD5_EDD0(x)                        (((uint32_t)(((uint32_t)(x)) << FLASH_UD5_EDD0_SHIFT)) & FLASH_UD5_EDD0_MASK)

#define MEM_76_PFLS_FLASH_UD5_EDD1_MASK                      (0x2000000U)
#define MEM_76_PFLS_FLASH_UD5_EDD1_SHIFT                     (25U)
#define MEM_76_PFLS_FLASH_UD5_EDD1_WIDTH                     (1U)
#define MEM_76_PFLS_FLASH_UD5_EDD1(x)                        (((uint32_t)(((uint32_t)(x)) << FLASH_UD5_EDD1_SHIFT)) & FLASH_UD5_EDD1_MASK)

#define MEM_76_PFLS_FLASH_UD5_EDD2_MASK                      (0x4000000U)
#define MEM_76_PFLS_FLASH_UD5_EDD2_SHIFT                     (26U)
#define MEM_76_PFLS_FLASH_UD5_EDD2_WIDTH                     (1U)
#define MEM_76_PFLS_FLASH_UD5_EDD2(x)                        (((uint32_t)(((uint32_t)(x)) << FLASH_UD5_EDD2_SHIFT)) & FLASH_UD5_EDD2_MASK)

#define MEM_76_PFLS_FLASH_UD5_EDD3_MASK                      (0x8000000U)
#define MEM_76_PFLS_FLASH_UD5_EDD3_SHIFT                     (27U)
#define MEM_76_PFLS_FLASH_UD5_EDD3_WIDTH                     (1U)
#define MEM_76_PFLS_FLASH_UD5_EDD3(x)                        (((uint32_t)(((uint32_t)(x)) << FLASH_UD5_EDD3_SHIFT)) & FLASH_UD5_EDD3_MASK)
/*! @} */

/*! @name UA0 - UTest Address 0 */
/*! @{ */

#define MEM_76_PFLS_FLASH_UA0_AEI_MASK                       (0xFFFFFFFFU)
#define MEM_76_PFLS_FLASH_UA0_AEI_SHIFT                      (0U)
#define MEM_76_PFLS_FLASH_UA0_AEI_WIDTH                      (32U)
#define MEM_76_PFLS_FLASH_UA0_AEI(x)                         (((uint32_t)(((uint32_t)(x)) << FLASH_UA0_AEI_SHIFT)) & FLASH_UA0_AEI_MASK)
/*! @} */

/*! @name UA1 - UTest Address 1 */
/*! @{ */

#define MEM_76_PFLS_FLASH_UA1_AEI_MASK                       (0xFFFFFU)
#define MEM_76_PFLS_FLASH_UA1_AEI_SHIFT                      (0U)
#define MEM_76_PFLS_FLASH_UA1_AEI_WIDTH                      (20U)
#define MEM_76_PFLS_FLASH_UA1_AEI(x)                         (((uint32_t)(((uint32_t)(x)) << FLASH_UA1_AEI_SHIFT)) & FLASH_UA1_AEI_MASK)
/*! @} */

/*! @name XMCR - Express Module Configuration */
/*! @{ */

#define MEM_76_PFLS_FLASH_XMCR_XEHV_MASK                     (0x1U)
#define MEM_76_PFLS_FLASH_XMCR_XEHV_SHIFT                    (0U)
#define MEM_76_PFLS_FLASH_XMCR_XEHV_WIDTH                    (1U)
#define MEM_76_PFLS_FLASH_XMCR_XEHV(x)                       (((uint32_t)(((uint32_t)(x)) << FLASH_XMCR_XEHV_SHIFT)) & FLASH_XMCR_XEHV_MASK)

#define MEM_76_PFLS_FLASH_XMCR_XPGM_MASK                     (0x100U)
#define MEM_76_PFLS_FLASH_XMCR_XPGM_SHIFT                    (8U)
#define MEM_76_PFLS_FLASH_XMCR_XPGM_WIDTH                    (1U)
#define MEM_76_PFLS_FLASH_XMCR_XPGM(x)                       (((uint32_t)(((uint32_t)(x)) << FLASH_XMCR_XPGM_SHIFT)) & FLASH_XMCR_XPGM_MASK)

#define MEM_76_PFLS_FLASH_XMCR_XEPEG_MASK                    (0x200U)
#define MEM_76_PFLS_FLASH_XMCR_XEPEG_SHIFT                   (9U)
#define MEM_76_PFLS_FLASH_XMCR_XEPEG_WIDTH                   (1U)
#define MEM_76_PFLS_FLASH_XMCR_XEPEG(x)                      (((uint32_t)(((uint32_t)(x)) << FLASH_XMCR_XEPEG_SHIFT)) & FLASH_XMCR_XEPEG_MASK)

#define MEM_76_PFLS_FLASH_XMCR_XWDIE_MASK                    (0x800U)
#define MEM_76_PFLS_FLASH_XMCR_XWDIE_SHIFT                   (11U)
#define MEM_76_PFLS_FLASH_XMCR_XWDIE_WIDTH                   (1U)
#define MEM_76_PFLS_FLASH_XMCR_XWDIE(x)                      (((uint32_t)(((uint32_t)(x)) << FLASH_XMCR_XWDIE_SHIFT)) & FLASH_XMCR_XWDIE_MASK)

#define MEM_76_PFLS_FLASH_XMCR_XWDI_MASK                     (0x1000U)
#define MEM_76_PFLS_FLASH_XMCR_XWDI_SHIFT                    (12U)
#define MEM_76_PFLS_FLASH_XMCR_XWDI_WIDTH                    (1U)
#define MEM_76_PFLS_FLASH_XMCR_XWDI(x)                       (((uint32_t)(((uint32_t)(x)) << FLASH_XMCR_XWDI_SHIFT)) & FLASH_XMCR_XWDI_MASK)

#define MEM_76_PFLS_FLASH_XMCR_XDOK_MASK                     (0x2000U)
#define MEM_76_PFLS_FLASH_XMCR_XDOK_SHIFT                    (13U)
#define MEM_76_PFLS_FLASH_XMCR_XDOK_WIDTH                    (1U)
#define MEM_76_PFLS_FLASH_XMCR_XDOK(x)                       (((uint32_t)(((uint32_t)(x)) << FLASH_XMCR_XDOK_SHIFT)) & FLASH_XMCR_XDOK_MASK)

#define MEM_76_PFLS_FLASH_XMCR_XPEG_MASK                     (0x4000U)
#define MEM_76_PFLS_FLASH_XMCR_XPEG_SHIFT                    (14U)
#define MEM_76_PFLS_FLASH_XMCR_XPEG_WIDTH                    (1U)
#define MEM_76_PFLS_FLASH_XMCR_XPEG(x)                       (((uint32_t)(((uint32_t)(x)) << FLASH_XMCR_XPEG_SHIFT)) & FLASH_XMCR_XPEG_MASK)

#define MEM_76_PFLS_FLASH_XMCR_XDONE_MASK                    (0x8000U)
#define MEM_76_PFLS_FLASH_XMCR_XDONE_SHIFT                   (15U)
#define MEM_76_PFLS_FLASH_XMCR_XDONE_WIDTH                   (1U)
#define MEM_76_PFLS_FLASH_XMCR_XDONE(x)                      (((uint32_t)(((uint32_t)(x)) << FLASH_XMCR_XDONE_SHIFT)) & FLASH_XMCR_XDONE_MASK)

#define MEM_76_PFLS_FLASH_XMCR_XPEID_MASK                    (0xFF0000U)
#define MEM_76_PFLS_FLASH_XMCR_XPEID_SHIFT                   (16U)
#define MEM_76_PFLS_FLASH_XMCR_XPEID_WIDTH                   (8U)
#define MEM_76_PFLS_FLASH_XMCR_XPEID(x)                      (((uint32_t)(((uint32_t)(x)) << FLASH_XMCR_XPEID_SHIFT)) & FLASH_XMCR_XPEID_MASK)
/*! @} */

/*! @name XPEADR - Express Program Address */
/*! @{ */

#define MEM_76_PFLS_FLASH_XPEADR_XPEADDR_MASK                (0x7FFE0U)
#define MEM_76_PFLS_FLASH_XPEADR_XPEADDR_SHIFT               (5U)
#define MEM_76_PFLS_FLASH_XPEADR_XPEADDR_WIDTH               (14U)
#define MEM_76_PFLS_FLASH_XPEADR_XPEADDR(x)                  (((uint32_t)(((uint32_t)(x)) << FLASH_XPEADR_XPEADDR_SHIFT)) & FLASH_XPEADR_XPEADDR_MASK)

