YUNSUNGWOONG/rtu_S32K312_R44-24.07.1_R240724_ARMGCC/Static_Code/Modules/Mem_R44/arch/delivery/inc/Mem_76_Pfls_Regs.h
#define MEM_76_PFLS_FLASH_XPEADR_XPEA0_MASK                  (0x80000U)
#define MEM_76_PFLS_FLASH_XPEADR_XPEA0_SHIFT                 (19U)
#define MEM_76_PFLS_FLASH_XPEADR_XPEA0_WIDTH                 (1U)
#define MEM_76_PFLS_FLASH_XPEADR_XPEA0(x)                    (((uint32_t)(((uint32_t)(x)) << FLASH_XPEADR_XPEA0_SHIFT)) & FLASH_XPEADR_XPEA0_MASK)

#define MEM_76_PFLS_FLASH_XPEADR_XPEA1_MASK                  (0x100000U)
#define MEM_76_PFLS_FLASH_XPEADR_XPEA1_SHIFT                 (20U)
#define MEM_76_PFLS_FLASH_XPEADR_XPEA1_WIDTH                 (1U)
#define MEM_76_PFLS_FLASH_XPEADR_XPEA1(x)                    (((uint32_t)(((uint32_t)(x)) << FLASH_XPEADR_XPEA1_SHIFT)) & FLASH_XPEADR_XPEA1_MASK)

#define MEM_76_PFLS_FLASH_XPEADR_XPEA2_MASK                  (0x200000U)
#define MEM_76_PFLS_FLASH_XPEADR_XPEA2_SHIFT                 (21U)
#define MEM_76_PFLS_FLASH_XPEADR_XPEA2_WIDTH                 (1U)
#define MEM_76_PFLS_FLASH_XPEADR_XPEA2(x)                    (((uint32_t)(((uint32_t)(x)) << FLASH_XPEADR_XPEA2_SHIFT)) & FLASH_XPEADR_XPEA2_MASK)

#define MEM_76_PFLS_FLASH_XPEADR_XPEA3_MASK                  (0x400000U)
#define MEM_76_PFLS_FLASH_XPEADR_XPEA3_SHIFT                 (22U)
#define MEM_76_PFLS_FLASH_XPEADR_XPEA3_WIDTH                 (1U)
#define MEM_76_PFLS_FLASH_XPEADR_XPEA3(x)                    (((uint32_t)(((uint32_t)(x)) << FLASH_XPEADR_XPEA3_SHIFT)) & FLASH_XPEADR_XPEA3_MASK)

#define MEM_76_PFLS_FLASH_XPEADR_XPEA4_MASK                  (0x800000U)
#define MEM_76_PFLS_FLASH_XPEADR_XPEA4_SHIFT                 (23U)
#define MEM_76_PFLS_FLASH_XPEADR_XPEA4_WIDTH                 (1U)
#define MEM_76_PFLS_FLASH_XPEADR_XPEA4(x)                    (((uint32_t)(((uint32_t)(x)) << FLASH_XPEADR_XPEA4_SHIFT)) & FLASH_XPEADR_XPEA4_MASK)

#define MEM_76_PFLS_FLASH_XPEADR_XPEA5_MASK                  (0x1000000U)
#define MEM_76_PFLS_FLASH_XPEADR_XPEA5_SHIFT                 (24U)
#define MEM_76_PFLS_FLASH_XPEADR_XPEA5_WIDTH                 (1U)
#define MEM_76_PFLS_FLASH_XPEADR_XPEA5(x)                    (((uint32_t)(((uint32_t)(x)) << FLASH_XPEADR_XPEA5_SHIFT)) & FLASH_XPEADR_XPEA5_MASK)
/*! @} */

/*! @name DATA - Program Data */
/*! @{ */

#define MEM_76_PFLS_FLASH_DATA_PDATA_MASK                    (0xFFFFFFFFU)
#define MEM_76_PFLS_FLASH_DATA_PDATA_SHIFT                   (0U)
#define MEM_76_PFLS_FLASH_DATA_PDATA_WIDTH                   (32U)
#define MEM_76_PFLS_FLASH_DATA_PDATA(x)                      (((uint32_t)(((uint32_t)(x)) << FLASH_DATA_PDATA_SHIFT)) & FLASH_DATA_PDATA_MASK)

/* ----------------------------------------------------------------------------
   -- PFLASH Register Masks - Flash Memory Controller
   ---------------------------------------------------------------------------- */

/*!
 * @addtogroup PFLASH_Register_Masks PFLASH Register Masks
 * @{
 */

/*! @name PFCR - Platform Flash Memory Configuration 0..Platform Flash Memory Configuration 2 */
/*! @{ */

#define MEM_76_PFLS_PFLASH_PFCR_P0_CBFEN_MASK                (0x1U)
#define MEM_76_PFLS_PFLASH_PFCR_P0_CBFEN_SHIFT               (0U)
#define MEM_76_PFLS_PFLASH_PFCR_P0_CBFEN_WIDTH               (1U)
#define MEM_76_PFLS_PFLASH_PFCR_P0_CBFEN(x)                  (((uint32_t)(((uint32_t)(x)) << MEM_76_PFLS_PFLASH_PFCR_P0_CBFEN_SHIFT)) & MEM_76_PFLS_PFLASH_PFCR_P0_CBFEN_MASK)

#define MEM_76_PFLS_PFLASH_PFCR_P0_DBFEN_MASK                (0x2U)
#define MEM_76_PFLS_PFLASH_PFCR_P0_DBFEN_SHIFT               (1U)
#define MEM_76_PFLS_PFLASH_PFCR_P0_DBFEN_WIDTH               (1U)
#define MEM_76_PFLS_PFLASH_PFCR_P0_DBFEN(x)                  (((uint32_t)(((uint32_t)(x)) << MEM_76_PFLS_PFLASH_PFCR_P0_DBFEN_SHIFT)) & MEM_76_PFLS_PFLASH_PFCR_P0_DBFEN_MASK)

#define MEM_76_PFLS_PFLASH_PFCR_P0_CPFEN_MASK                (0x10U)
#define MEM_76_PFLS_PFLASH_PFCR_P0_CPFEN_SHIFT               (4U)
#define MEM_76_PFLS_PFLASH_PFCR_P0_CPFEN_WIDTH               (1U)
#define MEM_76_PFLS_PFLASH_PFCR_P0_CPFEN(x)                  (((uint32_t)(((uint32_t)(x)) << MEM_76_PFLS_PFLASH_PFCR_P0_CPFEN_SHIFT)) & MEM_76_PFLS_PFLASH_PFCR_P0_CPFEN_MASK)

#define MEM_76_PFLS_PFLASH_PFCR_P0_DPFEN_MASK                (0x20U)
#define MEM_76_PFLS_PFLASH_PFCR_P0_DPFEN_SHIFT               (5U)
#define MEM_76_PFLS_PFLASH_PFCR_P0_DPFEN_WIDTH               (1U)
#define MEM_76_PFLS_PFLASH_PFCR_P0_DPFEN(x)                  (((uint32_t)(((uint32_t)(x)) << MEM_76_PFLS_PFLASH_PFCR_P0_DPFEN_SHIFT)) & MEM_76_PFLS_PFLASH_PFCR_P0_DPFEN_MASK)

#define MEM_76_PFLS_PFLASH_PFCR_P1_CBFEN_MASK                (0x1U)
#define MEM_76_PFLS_PFLASH_PFCR_P1_CBFEN_SHIFT               (0U)
#define MEM_76_PFLS_PFLASH_PFCR_P1_CBFEN_WIDTH               (1U)
#define MEM_76_PFLS_PFLASH_PFCR_P1_CBFEN(x)                  (((uint32_t)(((uint32_t)(x)) << MEM_76_PFLS_PFLASH_PFCR_P1_CBFEN_SHIFT)) & MEM_76_PFLS_PFLASH_PFCR_P1_CBFEN_MASK)

#define MEM_76_PFLS_PFLASH_PFCR_P1_DBFEN_MASK                (0x2U)
#define MEM_76_PFLS_PFLASH_PFCR_P1_DBFEN_SHIFT               (1U)
#define MEM_76_PFLS_PFLASH_PFCR_P1_DBFEN_WIDTH               (1U)
#define MEM_76_PFLS_PFLASH_PFCR_P1_DBFEN(x)                  (((uint32_t)(((uint32_t)(x)) << MEM_76_PFLS_PFLASH_PFCR_P1_DBFEN_SHIFT)) & MEM_76_PFLS_PFLASH_PFCR_P1_DBFEN_MASK)

#define MEM_76_PFLS_PFLASH_PFCR_P1_CPFEN_MASK                (0x10U)
#define MEM_76_PFLS_PFLASH_PFCR_P1_CPFEN_SHIFT               (4U)
#define MEM_76_PFLS_PFLASH_PFCR_P1_CPFEN_WIDTH               (1U)
#define MEM_76_PFLS_PFLASH_PFCR_P1_CPFEN(x)                  (((uint32_t)(((uint32_t)(x)) << MEM_76_PFLS_PFLASH_PFCR_P1_CPFEN_SHIFT)) & MEM_76_PFLS_PFLASH_PFCR_P1_CPFEN_MASK)

#define MEM_76_PFLS_PFLASH_PFCR_P1_DPFEN_MASK                (0x20U)
#define MEM_76_PFLS_PFLASH_PFCR_P1_DPFEN_SHIFT               (5U)
#define MEM_76_PFLS_PFLASH_PFCR_P1_DPFEN_WIDTH               (1U)
#define MEM_76_PFLS_PFLASH_PFCR_P1_DPFEN(x)                  (((uint32_t)(((uint32_t)(x)) << MEM_76_PFLS_PFLASH_PFCR_P1_DPFEN_SHIFT)) & MEM_76_PFLS_PFLASH_PFCR_P1_DPFEN_MASK)

#define MEM_76_PFLS_PFLASH_PFCR_P2_CBFEN_MASK                (0x1U)
#define MEM_76_PFLS_PFLASH_PFCR_P2_CBFEN_SHIFT               (0U)
#define MEM_76_PFLS_PFLASH_PFCR_P2_CBFEN_WIDTH               (1U)
#define MEM_76_PFLS_PFLASH_PFCR_P2_CBFEN(x)                  (((uint32_t)(((uint32_t)(x)) << MEM_76_PFLS_PFLASH_PFCR_P2_CBFEN_SHIFT)) & MEM_76_PFLS_PFLASH_PFCR_P2_CBFEN_MASK)

#define MEM_76_PFLS_PFLASH_PFCR_P2_DBFEN_MASK                (0x2U)
#define MEM_76_PFLS_PFLASH_PFCR_P2_DBFEN_SHIFT               (1U)
#define MEM_76_PFLS_PFLASH_PFCR_P2_DBFEN_WIDTH               (1U)
#define MEM_76_PFLS_PFLASH_PFCR_P2_DBFEN(x)                  (((uint32_t)(((uint32_t)(x)) << MEM_76_PFLS_PFLASH_PFCR_P2_DBFEN_SHIFT)) & MEM_76_PFLS_PFLASH_PFCR_P2_DBFEN_MASK)

#define MEM_76_PFLS_PFLASH_PFCR_P2_CPFEN_MASK                (0x10U)
#define MEM_76_PFLS_PFLASH_PFCR_P2_CPFEN_SHIFT               (4U)
#define MEM_76_PFLS_PFLASH_PFCR_P2_CPFEN_WIDTH               (1U)
#define MEM_76_PFLS_PFLASH_PFCR_P2_CPFEN(x)                  (((uint32_t)(((uint32_t)(x)) << MEM_76_PFLS_PFLASH_PFCR_P2_CPFEN_SHIFT)) & MEM_76_PFLS_PFLASH_PFCR_P2_CPFEN_MASK)

