YUNSUNGWOONG/rtu_S32K312_R44-24.07.1_R240724_ARMGCC/Static_Code/Modules/Mem_R44/arch/delivery/inc/Mem_76_Pfls_Regs.h
#define MEM_76_PFLS_PFLASH_PFCR_P2_DPFEN_MASK                (0x20U)
#define MEM_76_PFLS_PFLASH_PFCR_P2_DPFEN_SHIFT               (5U)
#define MEM_76_PFLS_PFLASH_PFCR_P2_DPFEN_WIDTH               (1U)
#define MEM_76_PFLS_PFLASH_PFCR_P2_DPFEN(x)                  (((uint32_t)(((uint32_t)(x)) << MEM_76_PFLS_PFLASH_PFCR_P2_DPFEN_SHIFT)) & MEM_76_PFLS_PFLASH_PFCR_P2_DPFEN_MASK)
/*! @} */

/*! @name PFCR4 - Platform Flash Memory Configuration 4 */
/*! @{ */

#define MEM_76_PFLS_PFLASH_PFCR4_DERR_SUP_MASK               (0x1U)
#define MEM_76_PFLS_PFLASH_PFCR4_DERR_SUP_SHIFT              (0U)
#define MEM_76_PFLS_PFLASH_PFCR4_DERR_SUP_WIDTH              (1U)
#define MEM_76_PFLS_PFLASH_PFCR4_DERR_SUP(x)                 (((uint32_t)(((uint32_t)(x)) << MEM_76_PFLS_PFLASH_PFCR4_DERR_SUP_SHIFT)) & MEM_76_PFLS_PFLASH_PFCR4_DERR_SUP_MASK)

#define MEM_76_PFLS_PFLASH_PFCR4_BLK4_PS_MASK                (0xEU)
#define MEM_76_PFLS_PFLASH_PFCR4_BLK4_PS_SHIFT               (1U)
#define MEM_76_PFLS_PFLASH_PFCR4_BLK4_PS_WIDTH               (3U)
#define MEM_76_PFLS_PFLASH_PFCR4_BLK4_PS(x)                  (((uint32_t)(((uint32_t)(x)) << MEM_76_PFLS_PFLASH_PFCR4_BLK4_PS_SHIFT)) & MEM_76_PFLS_PFLASH_PFCR4_BLK4_PS_MASK)

#define MEM_76_PFLS_PFLASH_PFCR4_DMEEE_MASK                  (0x80U)
#define MEM_76_PFLS_PFLASH_PFCR4_DMEEE_SHIFT                 (7U)
#define MEM_76_PFLS_PFLASH_PFCR4_DMEEE_WIDTH                 (1U)
#define MEM_76_PFLS_PFLASH_PFCR4_DMEEE(x)                    (((uint32_t)(((uint32_t)(x)) << MEM_76_PFLS_PFLASH_PFCR4_DMEEE_SHIFT)) & MEM_76_PFLS_PFLASH_PFCR4_DMEEE_MASK)
/*! @} */

/*! @name PFAPR - Platform Flash Memory Access Protection */
/*! @{ */

#define MEM_76_PFLS_PFLASH_PFAPR_M15AP_MASK                  (0x3U)
#define MEM_76_PFLS_PFLASH_PFAPR_M15AP_SHIFT                 (0U)
#define MEM_76_PFLS_PFLASH_PFAPR_M15AP_WIDTH                 (2U)
#define MEM_76_PFLS_PFLASH_PFAPR_M15AP(x)                    (((uint32_t)(((uint32_t)(x)) << MEM_76_PFLS_PFLASH_PFAPR_M15AP_SHIFT)) & MEM_76_PFLS_PFLASH_PFAPR_M15AP_MASK)

#define MEM_76_PFLS_PFLASH_PFAPR_M14AP_MASK                  (0xCU)
#define MEM_76_PFLS_PFLASH_PFAPR_M14AP_SHIFT                 (2U)
#define MEM_76_PFLS_PFLASH_PFAPR_M14AP_WIDTH                 (2U)
#define MEM_76_PFLS_PFLASH_PFAPR_M14AP(x)                    (((uint32_t)(((uint32_t)(x)) << MEM_76_PFLS_PFLASH_PFAPR_M14AP_SHIFT)) & MEM_76_PFLS_PFLASH_PFAPR_M14AP_MASK)

#define MEM_76_PFLS_PFLASH_PFAPR_M13AP_MASK                  (0x30U)
#define MEM_76_PFLS_PFLASH_PFAPR_M13AP_SHIFT                 (4U)
#define MEM_76_PFLS_PFLASH_PFAPR_M13AP_WIDTH                 (2U)
#define MEM_76_PFLS_PFLASH_PFAPR_M13AP(x)                    (((uint32_t)(((uint32_t)(x)) << MEM_76_PFLS_PFLASH_PFAPR_M13AP_SHIFT)) & MEM_76_PFLS_PFLASH_PFAPR_M13AP_MASK)

#define MEM_76_PFLS_PFLASH_PFAPR_M12AP_MASK                  (0xC0U)
#define MEM_76_PFLS_PFLASH_PFAPR_M12AP_SHIFT                 (6U)
#define MEM_76_PFLS_PFLASH_PFAPR_M12AP_WIDTH                 (2U)
#define MEM_76_PFLS_PFLASH_PFAPR_M12AP(x)                    (((uint32_t)(((uint32_t)(x)) << MEM_76_PFLS_PFLASH_PFAPR_M12AP_SHIFT)) & MEM_76_PFLS_PFLASH_PFAPR_M12AP_MASK)

#define MEM_76_PFLS_PFLASH_PFAPR_M11AP_MASK                  (0x300U)
#define MEM_76_PFLS_PFLASH_PFAPR_M11AP_SHIFT                 (8U)
#define MEM_76_PFLS_PFLASH_PFAPR_M11AP_WIDTH                 (2U)
#define MEM_76_PFLS_PFLASH_PFAPR_M11AP(x)                    (((uint32_t)(((uint32_t)(x)) << MEM_76_PFLS_PFLASH_PFAPR_M11AP_SHIFT)) & MEM_76_PFLS_PFLASH_PFAPR_M11AP_MASK)

#define MEM_76_PFLS_PFLASH_PFAPR_M10AP_MASK                  (0xC00U)
#define MEM_76_PFLS_PFLASH_PFAPR_M10AP_SHIFT                 (10U)
#define MEM_76_PFLS_PFLASH_PFAPR_M10AP_WIDTH                 (2U)
#define MEM_76_PFLS_PFLASH_PFAPR_M10AP(x)                    (((uint32_t)(((uint32_t)(x)) << MEM_76_PFLS_PFLASH_PFAPR_M10AP_SHIFT)) & MEM_76_PFLS_PFLASH_PFAPR_M10AP_MASK)

#define MEM_76_PFLS_PFLASH_PFAPR_M9AP_MASK                   (0x3000U)
#define MEM_76_PFLS_PFLASH_PFAPR_M9AP_SHIFT                  (12U)
#define MEM_76_PFLS_PFLASH_PFAPR_M9AP_WIDTH                  (2U)
#define MEM_76_PFLS_PFLASH_PFAPR_M9AP(x)                     (((uint32_t)(((uint32_t)(x)) << MEM_76_PFLS_PFLASH_PFAPR_M9AP_SHIFT)) & MEM_76_PFLS_PFLASH_PFAPR_M9AP_MASK)

#define MEM_76_PFLS_PFLASH_PFAPR_M8AP_MASK                   (0xC000U)
#define MEM_76_PFLS_PFLASH_PFAPR_M8AP_SHIFT                  (14U)
#define MEM_76_PFLS_PFLASH_PFAPR_M8AP_WIDTH                  (2U)
#define MEM_76_PFLS_PFLASH_PFAPR_M8AP(x)                     (((uint32_t)(((uint32_t)(x)) << MEM_76_PFLS_PFLASH_PFAPR_M8AP_SHIFT)) & MEM_76_PFLS_PFLASH_PFAPR_M8AP_MASK)

#define MEM_76_PFLS_PFLASH_PFAPR_M7AP_MASK                   (0x30000U)
#define MEM_76_PFLS_PFLASH_PFAPR_M7AP_SHIFT                  (16U)
#define MEM_76_PFLS_PFLASH_PFAPR_M7AP_WIDTH                  (2U)
#define MEM_76_PFLS_PFLASH_PFAPR_M7AP(x)                     (((uint32_t)(((uint32_t)(x)) << MEM_76_PFLS_PFLASH_PFAPR_M7AP_SHIFT)) & MEM_76_PFLS_PFLASH_PFAPR_M7AP_MASK)

#define MEM_76_PFLS_PFLASH_PFAPR_M6AP_MASK                   (0xC0000U)
#define MEM_76_PFLS_PFLASH_PFAPR_M6AP_SHIFT                  (18U)
#define MEM_76_PFLS_PFLASH_PFAPR_M6AP_WIDTH                  (2U)
#define MEM_76_PFLS_PFLASH_PFAPR_M6AP(x)                     (((uint32_t)(((uint32_t)(x)) << MEM_76_PFLS_PFLASH_PFAPR_M6AP_SHIFT)) & MEM_76_PFLS_PFLASH_PFAPR_M6AP_MASK)

#define MEM_76_PFLS_PFLASH_PFAPR_M5AP_MASK                   (0x300000U)
#define MEM_76_PFLS_PFLASH_PFAPR_M5AP_SHIFT                  (20U)
#define MEM_76_PFLS_PFLASH_PFAPR_M5AP_WIDTH                  (2U)
#define MEM_76_PFLS_PFLASH_PFAPR_M5AP(x)                     (((uint32_t)(((uint32_t)(x)) << MEM_76_PFLS_PFLASH_PFAPR_M5AP_SHIFT)) & MEM_76_PFLS_PFLASH_PFAPR_M5AP_MASK)

#define MEM_76_PFLS_PFLASH_PFAPR_M4AP_MASK                   (0xC00000U)
#define MEM_76_PFLS_PFLASH_PFAPR_M4AP_SHIFT                  (22U)
#define MEM_76_PFLS_PFLASH_PFAPR_M4AP_WIDTH                  (2U)
#define MEM_76_PFLS_PFLASH_PFAPR_M4AP(x)                     (((uint32_t)(((uint32_t)(x)) << MEM_76_PFLS_PFLASH_PFAPR_M4AP_SHIFT)) & MEM_76_PFLS_PFLASH_PFAPR_M4AP_MASK)

