YUNSUNGWOONG/rtu_S32K312_R44-24.07.1_R240724_ARMGCC/Static_Code/Modules/Mem_R44/arch/delivery/inc/Mem_76_Pfls_Regs.h
#define MEM_76_PFLS_PFLASH_PFAPR_M2AP_MASK                   (0xC000000U)
#define MEM_76_PFLS_PFLASH_PFAPR_M2AP_SHIFT                  (26U)
#define MEM_76_PFLS_PFLASH_PFAPR_M2AP_WIDTH                  (2U)
#define MEM_76_PFLS_PFLASH_PFAPR_M2AP(x)                     (((uint32_t)(((uint32_t)(x)) << MEM_76_PFLS_PFLASH_PFAPR_M2AP_SHIFT)) & MEM_76_PFLS_PFLASH_PFAPR_M2AP_MASK)

#define MEM_76_PFLS_PFLASH_PFAPR_M1AP_MASK                   (0x30000000U)
#define MEM_76_PFLS_PFLASH_PFAPR_M1AP_SHIFT                  (28U)
#define MEM_76_PFLS_PFLASH_PFAPR_M1AP_WIDTH                  (2U)
#define MEM_76_PFLS_PFLASH_PFAPR_M1AP(x)                     (((uint32_t)(((uint32_t)(x)) << MEM_76_PFLS_PFLASH_PFAPR_M1AP_SHIFT)) & MEM_76_PFLS_PFLASH_PFAPR_M1AP_MASK)

#define MEM_76_PFLS_PFLASH_PFAPR_M0AP_MASK                   (0xC0000000U)
#define MEM_76_PFLS_PFLASH_PFAPR_M0AP_SHIFT                  (30U)
#define MEM_76_PFLS_PFLASH_PFAPR_M0AP_WIDTH                  (2U)
#define MEM_76_PFLS_PFLASH_PFAPR_M0AP(x)                     (((uint32_t)(((uint32_t)(x)) << MEM_76_PFLS_PFLASH_PFAPR_M0AP_SHIFT)) & MEM_76_PFLS_PFLASH_PFAPR_M0AP_MASK)
/*! @} */

/*! @name PFCPGM_PEADR_L - Platform Flash Memory Program Erase Address Logical */
/*! @{ */

#define MEM_76_PFLS_PFLASH_PFCPGM_PEADR_L_PEADR_L_MASK       (0xFFFFFFFFU)
#define MEM_76_PFLS_PFLASH_PFCPGM_PEADR_L_PEADR_L_SHIFT      (0U)
#define MEM_76_PFLS_PFLASH_PFCPGM_PEADR_L_PEADR_L_WIDTH      (32U)
#define MEM_76_PFLS_PFLASH_PFCPGM_PEADR_L_PEADR_L(x)         (((uint32_t)(((uint32_t)(x)) << MEM_76_PFLS_PFLASH_PFCPGM_PEADR_L_PEADR_L_SHIFT)) & MEM_76_PFLS_PFLASH_PFCPGM_PEADR_L_PEADR_L_MASK)
/*! @} */

/*! @name PFCPGM_PEADR_P - Platform Flash Memory Program Erase Address Physical */
/*! @{ */

#define MEM_76_PFLS_PFLASH_PFCPGM_PEADR_P_PEADR_P_MASK       (0xFFFFFFFFU)
#define MEM_76_PFLS_PFLASH_PFCPGM_PEADR_P_PEADR_P_SHIFT      (0U)
#define MEM_76_PFLS_PFLASH_PFCPGM_PEADR_P_PEADR_P_WIDTH      (32U)
#define MEM_76_PFLS_PFLASH_PFCPGM_PEADR_P_PEADR_P(x)         (((uint32_t)(((uint32_t)(x)) << MEM_76_PFLS_PFLASH_PFCPGM_PEADR_P_PEADR_P_SHIFT)) & MEM_76_PFLS_PFLASH_PFCPGM_PEADR_P_PEADR_P_MASK)
/*! @} */

/*! @name PFCPGM_XPEADR_L - Platform Flash Memory Express Program Erase Address Logical */
/*! @{ */

#define MEM_76_PFLS_PFLASH_PFCPGM_XPEADR_L_XPEADR_L_MASK     (0xFFFFFFFFU)
#define MEM_76_PFLS_PFLASH_PFCPGM_XPEADR_L_XPEADR_L_SHIFT    (0U)
#define MEM_76_PFLS_PFLASH_PFCPGM_XPEADR_L_XPEADR_L_WIDTH    (32U)
#define MEM_76_PFLS_PFLASH_PFCPGM_XPEADR_L_XPEADR_L(x)       (((uint32_t)(((uint32_t)(x)) << MEM_76_PFLS_PFLASH_PFCPGM_XPEADR_L_XPEADR_L_SHIFT)) & MEM_76_PFLS_PFLASH_PFCPGM_XPEADR_L_XPEADR_L_MASK)
/*! @} */

/*! @name PFCPGM_XPEADR_P - Platform Flash Memory Express Program Erase Address Physical */
/*! @{ */

#define MEM_76_PFLS_PFLASH_PFCPGM_XPEADR_P_XPEADR_P_MASK     (0xFFFFFFFFU)
#define MEM_76_PFLS_PFLASH_PFCPGM_XPEADR_P_XPEADR_P_SHIFT    (0U)
#define MEM_76_PFLS_PFLASH_PFCPGM_XPEADR_P_XPEADR_P_WIDTH    (32U)
#define MEM_76_PFLS_PFLASH_PFCPGM_XPEADR_P_XPEADR_P(x)       (((uint32_t)(((uint32_t)(x)) << MEM_76_PFLS_PFLASH_PFCPGM_XPEADR_P_XPEADR_P_SHIFT)) & MEM_76_PFLS_PFLASH_PFCPGM_XPEADR_P_XPEADR_P_MASK)
/*! @} */

/*! @name PFCBLK_SPELOCK - Block n Sector Program Erase Lock */
/*! @{ */

#define MEM_76_PFLS_PFLASH_PFCBLK_SPELOCK_SLCK_MASK          (0xFFFFFFFFU)
#define MEM_76_PFLS_PFLASH_PFCBLK_SPELOCK_SLCK_SHIFT         (0U)
#define MEM_76_PFLS_PFLASH_PFCBLK_SPELOCK_SLCK_WIDTH         (32U)
#define MEM_76_PFLS_PFLASH_PFCBLK_SPELOCK_SLCK(x)            (((uint32_t)(((uint32_t)(x)) << MEM_76_PFLS_PFLASH_PFCBLK_SPELOCK_SLCK_SHIFT)) & MEM_76_PFLS_PFLASH_PFCBLK_SPELOCK_SLCK_MASK)
/*! @} */

/*! @name PFCBLKU_SPELOCK - Block UTEST Sector Program Erase Lock */
/*! @{ */

#define MEM_76_PFLS_PFLASH_PFCBLKU_SPELOCK_SLCK_MASK         (0x1U)
#define MEM_76_PFLS_PFLASH_PFCBLKU_SPELOCK_SLCK_SHIFT        (0U)
#define MEM_76_PFLS_PFLASH_PFCBLKU_SPELOCK_SLCK_WIDTH        (1U)
#define MEM_76_PFLS_PFLASH_PFCBLKU_SPELOCK_SLCK(x)           (((uint32_t)(((uint32_t)(x)) << MEM_76_PFLS_PFLASH_PFCBLKU_SPELOCK_SLCK_SHIFT)) & MEM_76_PFLS_PFLASH_PFCBLKU_SPELOCK_SLCK_MASK)
/*! @} */

/*! @name PFCBLK_SSPELOCK - Block n Super Sector Program Erase Lock */
/*! @{ */

#define MEM_76_PFLS_PFLASH_PFCBLK_SSPELOCK_SSLCK_MASK        (0xFFFU)
#define MEM_76_PFLS_PFLASH_PFCBLK_SSPELOCK_SSLCK_SHIFT       (0U)
#define MEM_76_PFLS_PFLASH_PFCBLK_SSPELOCK_SSLCK_WIDTH       (12U)
#define MEM_76_PFLS_PFLASH_PFCBLK_SSPELOCK_SSLCK(x)          (((uint32_t)(((uint32_t)(x)) << MEM_76_PFLS_PFLASH_PFCBLK_SSPELOCK_SSLCK_SHIFT)) & MEM_76_PFLS_PFLASH_PFCBLK_SSPELOCK_SSLCK_MASK)
/*! @} */

/*! @name PFCBLK_SETSLOCK - Block n Set Sector Lock */
/*! @{ */

#define MEM_76_PFLS_PFLASH_PFCBLK_SETSLOCK_SETSLCK_MASK      (0xFFFFFFFFU)
#define MEM_76_PFLS_PFLASH_PFCBLK_SETSLOCK_SETSLCK_SHIFT     (0U)
#define MEM_76_PFLS_PFLASH_PFCBLK_SETSLOCK_SETSLCK_WIDTH     (32U)
#define MEM_76_PFLS_PFLASH_PFCBLK_SETSLOCK_SETSLCK(x)        (((uint32_t)(((uint32_t)(x)) << MEM_76_PFLS_PFLASH_PFCBLK_SETSLOCK_SETSLCK_SHIFT)) & MEM_76_PFLS_PFLASH_PFCBLK_SETSLOCK_SETSLCK_MASK)
/*! @} */

/*! @name PFCBLKU_SETSLOCK - Block UTEST Set Sector Lock */
/*! @{ */

#define MEM_76_PFLS_PFLASH_PFCBLKU_SETSLOCK_SETSLCK_MASK     (0x1U)
#define MEM_76_PFLS_PFLASH_PFCBLKU_SETSLOCK_SETSLCK_SHIFT    (0U)
#define MEM_76_PFLS_PFLASH_PFCBLKU_SETSLOCK_SETSLCK_WIDTH    (1U)
#define MEM_76_PFLS_PFLASH_PFCBLKU_SETSLOCK_SETSLCK(x)       (((uint32_t)(((uint32_t)(x)) << MEM_76_PFLS_PFLASH_PFCBLKU_SETSLOCK_SETSLCK_SHIFT)) & MEM_76_PFLS_PFLASH_PFCBLKU_SETSLOCK_SETSLCK_MASK)
/*! @} */

/*! @name PFCBLK_SSETSLOCK - Block n Set Super Sector Lock */
/*! @{ */

#define MEM_76_PFLS_PFLASH_PFCBLK_SSETSLOCK_SSETSLCK_MASK    (0xFFFU)
#define MEM_76_PFLS_PFLASH_PFCBLK_SSETSLOCK_SSETSLCK_SHIFT   (0U)
#define MEM_76_PFLS_PFLASH_PFCBLK_SSETSLOCK_SSETSLCK_WIDTH   (12U)
#define MEM_76_PFLS_PFLASH_PFCBLK_SSETSLOCK_SSETSLCK(x)      (((uint32_t)(((uint32_t)(x)) << MEM_76_PFLS_PFLASH_PFCBLK_SSETSLOCK_SSETSLCK_SHIFT)) & MEM_76_PFLS_PFLASH_PFCBLK_SSETSLOCK_SSETSLCK_MASK)
/*! @} */

