YUNSUNGWOONG/rtu_S32K312_R44-24.07.1_R240724_ARMGCC/Static_Code/Modules/Mem_R44/arch/delivery/inc/Mem_76_Pfls_Regs.h
/*! @name PFCBLK_LOCKMASTER_S - Block a Lock Master Sector b */
/*! @{ */

#define MEM_76_PFLS_PFLASH_PFCBLK_LOCKMASTER_S_LOCKMASTER_S_MASK (0xFFFFFFFFU)
#define MEM_76_PFLS_PFLASH_PFCBLK_LOCKMASTER_S_LOCKMASTER_S_SHIFT (0U)
#define MEM_76_PFLS_PFLASH_PFCBLK_LOCKMASTER_S_LOCKMASTER_S_WIDTH (32U)
#define MEM_76_PFLS_PFLASH_PFCBLK_LOCKMASTER_S_LOCKMASTER_S(x) (((uint32_t)(((uint32_t)(x)) << MEM_76_PFLS_PFLASH_PFCBLK_LOCKMASTER_S_LOCKMASTER_S_SHIFT)) & MEM_76_PFLS_PFLASH_PFCBLK_LOCKMASTER_S_LOCKMASTER_S_MASK)
/*! @} */

/*! @name PFCBLKU_LOCKMASTER_S - Block UTEST Lock Master Sector */
/*! @{ */

#define MEM_76_PFLS_PFLASH_PFCBLKU_LOCKMASTER_S_LOCKMASTER_S_MASK (0xFFU)
#define MEM_76_PFLS_PFLASH_PFCBLKU_LOCKMASTER_S_LOCKMASTER_S_SHIFT (0U)
#define MEM_76_PFLS_PFLASH_PFCBLKU_LOCKMASTER_S_LOCKMASTER_S_WIDTH (8U)
#define MEM_76_PFLS_PFLASH_PFCBLKU_LOCKMASTER_S_LOCKMASTER_S(x) (((uint32_t)(((uint32_t)(x)) << MEM_76_PFLS_PFLASH_PFCBLKU_LOCKMASTER_S_LOCKMASTER_S_SHIFT)) & MEM_76_PFLS_PFLASH_PFCBLKU_LOCKMASTER_S_LOCKMASTER_S_MASK)
/*! @} */

/*! @name PFCBLK_LOCKMASTER_SS - Block m Lock Master Super Sector n */
/*! @{ */

#define MEM_76_PFLS_PFLASH_PFCBLK_LOCKMASTER_SS_LOCKMASTER_SS_MASK (0xFFFFFFFFU)
#define MEM_76_PFLS_PFLASH_PFCBLK_LOCKMASTER_SS_LOCKMASTER_SS_SHIFT (0U)
#define MEM_76_PFLS_PFLASH_PFCBLK_LOCKMASTER_SS_LOCKMASTER_SS_WIDTH (32U)
#define MEM_76_PFLS_PFLASH_PFCBLK_LOCKMASTER_SS_LOCKMASTER_SS(x) (((uint32_t)(((uint32_t)(x)) << MEM_76_PFLS_PFLASH_PFCBLK_LOCKMASTER_SS_LOCKMASTER_SS_SHIFT)) & MEM_76_PFLS_PFLASH_PFCBLK_LOCKMASTER_SS_LOCKMASTER_SS_MASK)
/*! @} */

/*! @name DCMSTAT - DCM Status */
/*! @{ */

#define MEM_76_PFLS_PFLASH_DCMSTAT_DCMOTAR_MASK (0x1U)
#define MEM_76_PFLS_PFLASH_DCMSTAT_DCMOTAR_SHIFT (17U)
#define MEM_76_PFLS_PFLASH_DCMSTAT_DCMOTAR_WIDTH (1U)

#define MEM_76_PFLS_PFLASH_DCMSTAT_DCMOTAA_MASK (0x1U)
#define MEM_76_PFLS_PFLASH_DCMSTAT_DCMOTAA_SHIFT (16U)
#define MEM_76_PFLS_PFLASH_DCMSTAT_DCMOTAA_WIDTH (1U)

#endif
